/*1 задание

Определите результат и тип переменных в следующих случаях:*/

var r = '9' + 0; // "90"

var r = 9 + '0'; // "90"

var r = 4 + 9; // 13

var r = null + 7; // 7

var r = '6' + null; // "6null"

var r = '6' + []; // "6"

var r = '6' + undefined; // "6undefined"

/*2 задание

Будет ли верным выражение:

    2/3 + 1 + 1/3 == 2
Опишите почему да или нет?*/

// ОТВЕТ: Нет. В левой части получаем 0,66(6) + 1 + 0,33(3) что в сумме дает 1,99(9) что не равно 2.


/*3 задание

Определите результат в следующих случаях:*/

var r;
var t = ++2; // error - такие операции можно проводить только с переменными
var u = 1++; // error - такие операции можно проводить только с переменными
var w = 2--; // error - такие операции можно проводить только с переменными

r = 6 && 0 && 7; // 0

r = -9 && -8; // -8

r = 6 && 0 && 7; // 0

r = "string" && 0; // 0

r = [] && {} && 7; // 7

r = [] || 7; // []

r = {} || 0; // {}

r = false || true; // true

r = "2" > "3"; // false

r = "ab" <= "fg"; //true

r = "2k" <= "8l"; // true

r = "2" != 2; // false

r = "2" !== 2; // true

r = t + 2;  // error - такие операции можно проводить только с переменными

r = t + 2--; // error - такие операции можно проводить только с переменными

r = u - w; // error - такие операции можно проводить только с переменными